results/IntelR_XeonR_Gold_6130_CPU_@_2.10GHz_X86_64/rocksdb/outputs/bulkload/benchmark_bulkload_compact.log
/usr/bin/time -f '%e %U %S' -o /tmp/app-repl-numa-benchmarks/results/IntelR_XeonR_Gold_6130_CPU_@_2.10GHz_X86_64/rocksdb/outputs/bulkload/benchmark_bulkload_compact.log.time ./db_bench --benchmarks=compact,stats --use_existing_db=1 --disable_auto_compactions=1 --sync=0 --level0_file_num_compaction_trigger=4 --level0_slowdown_writes_trigger=20 --level0_stop_writes_trigger=30 --max_background_jobs=16 --max_write_buffer_number=8 --undefok=use_blob_cache,use_shared_block_and_blob_cache,blob_cache_size,blob_cache_numshardbits,prepopulate_blob_cache,multiread_batched,cache_low_pri_pool_ratio,prepopulate_block_cache --db=/tmp/rocksdb/db --wal_dir=/tmp/rocksdb/wal --num=8000000 --key_size=20 --value_size=400 --block_size=8192 --cache_size=32000000000 --cache_numshardbits=6 --compression_max_dict_bytes=0 --compression_ratio=0.5 --compression_type=none --bytes_per_sync=1048576 --benchmark_write_rate_limit=0 --write_buffer_size=134217728 --target_file_size_base=134217728 --max_bytes_for_level_base=1073741824 --verify_checksum=1 --delete_obsolete_files_period_micros=62914560 --max_bytes_for_level_multiplier=8 --statistics=0 --stats_per_interval=1 --stats_interval_seconds=60 --report_interval_seconds=1 --histogram=1 --memtablerep=skip_list --bloom_bits=10 --open_files=-1 --subcompactions=1 --compaction_style=0 --num_levels=8 --min_level_to_compress=-1 --level_compaction_dynamic_level_bytes=true --pin_l0_filter_and_index_blocks_in_cache=1 --threads=1 2>&1 | tee -a /tmp/app-repl-numa-benchmarks/results/IntelR_XeonR_Gold_6130_CPU_@_2.10GHz_X86_64/rocksdb/outputs/bulkload/benchmark_bulkload_compact.log
RocksDB:    version 10.5.0
Date:       Wed Dec  3 02:24:19 2025
CPU:        128 * Intel(R) Xeon(R) Gold 6130 CPU @ 2.10GHz
CPUCache:   22528 KB
Set seed to 1764725059203531 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       20 bytes each (+ 0 bytes user-defined timestamp)
Values:     400 bytes each (200 bytes after compression)
Entries:    8000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    3204.3 MB (estimated)
FileSize:   1678.5 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
DB path: [/tmp/rocksdb/db]
compact      : 7691828.000 micros/op 0 ops/sec 7.692 seconds 1 operations;


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) WPreComp(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L7     17/0      2.02 GB   0.0      3.1     3.1      0.0       2.0       2.0      2.0       0.0   0.6    441.4    286.0      7.23              6.65         1    7.235   7805K  2747K       0.0       0.0
 Sum     17/0      2.02 GB   0.0      3.1     3.1      0.0       2.0       2.0      2.0       0.0   0.0    441.4    286.0      7.23              6.65         1    7.235   7805K  2747K       0.0       0.0
 Int      0/0      0.00 KB   0.0      3.1     3.1      0.0       2.0       2.0      2.0       0.0 2169496113.0    441.4    286.0      7.23              6.65         1    7.235   7805K  2747K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) WPreComp(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0      0.00 KB   0.0      3.1     3.1      0.0       2.0       2.0      2.0       0.0   0.0    441.4    286.0      7.23              6.65         1    7.235   7805K  2747K       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 7.7 total, 7.7 interval
Flush(GB): cumulative 0.000, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 2.02 GB write, 268.45 MB/s write, 3.12 GB read, 414.33 MB/s read, 7.2 seconds
Interval compaction: 2.02 GB write, 268.87 MB/s write, 3.12 GB read, 414.98 MB/s read, 7.2 seconds
Estimated pending compaction bytes: 0
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 0, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 0, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 0, total-stops: 0
Block cache LRUCache@0x55e608272eb0#1220164 capacity: 29.80 GB seed: 306688459 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 0 last_secs: 6.7e-05 secs_since: 7
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 7.7 total, 7.7 interval
Cumulative writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 GB, 0.00 MB/s
Cumulative WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 MB, 0.00 MB/s
Interval WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0